app/views/pages/index.html.erb

      <td class="center"><%= status_tag(page.visible) %></td>
      <td class="center"><%= page.sections.size %></td>
---
SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 2