app/controllers/access_controller.rb

  def attempt_login
  	if params[:username].present? && params[:password].present?
  		found_user = AdminUser.where(:username => params[:username]).first
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`username` = 'sadf' ORDER BY `admin_users`.`id` ASC LIMIT 1