app/controllers/pages_controller.rb

  def show
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1

  def new
    @page = Page.new
    @subjects = Subject.order('position ASC')
    @page_count  = Page.count + 1
---
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def create
    @page = Page.new(page_params)

    if @page.save
---
INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`) VALUES ('2014-05-03 11:33:10', 'new page', 'new', 9, 1, '2014-05-03 11:33:10')

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count  = Page.count
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
SELECT `subjects`.* FROM `subjects` ORDER BY position ASC
SELECT COUNT(*) FROM `pages`

  def update
    @page = Page.find(params[:id])

    if @page.update_attributes(page_params)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
UPDATE `pages` SET `name` = 'new pages', `updated_at` = '2014-05-03 11:33:23' WHERE `pages`.`id` = 4

  def delete
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1

  def destroy
    page = Page.find(params[:id])
    page.destroy
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
DELETE FROM `pages` WHERE `pages`.`id` = 4