app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def show
    @section = Section.find(params[:id])

SELECT COUNT(*) FROM `sections`
---
  def new
    @section = Section.new
    @section_count = Section.count + 1

INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`, `visible`) VALUES ('second section', 'text', '2014-05-04 03:47:43', 'second section', 2, 1, '2014-05-04 03:47:43', 1)
---
  def create
    @section = Section.new(section_params)

    if @section.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `sections`
SELECT `pages`.* FROM `pages` ORDER BY position ASC
---
  def edit
    @section = Section.find(params[:id])
    @section_count = Section.count
    @pages = Page.order('position ASC')

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
UPDATE `sections` SET `visible` = 1, `content_type` = 'HTML', `content` = 'aaaloo', `updated_at` = '2014-05-04 03:47:07' WHERE `sections`.`id` = 1
---
  def update
    @section = Section.find(params[:id])

    if @section.update_attributes(section_params)

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def delete
    @section = Section.find(params[:id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
DELETE FROM `sections` WHERE `sections`.`id` = 2
---
  def destroy
    section = Section.find(params[:id])
    section.destroy