app/controllers/subjects_controller.rb

  def show
    @subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1

  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    #instantiate new object
    @subject = Subject.new(subject_params)
    #save object
    if @subject.save
      # if save succeeds, redirect
      flash[:notice] = "Subject created successfully"
      redirect_to(:action => 'index')
    else
      # if save fails, display form again
      @subject_count = Subject.count + 1
---
INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`, `visible`) VALUES ('2014-05-04 03:20:00', 'Third Subject', 3, '2014-05-04 03:20:23', 1)
SELECT COUNT(*) FROM `subjects`

  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    #Find a subject
    @subject = Subject.find(params[:id])
    #update object
    if @subject.update_attributes(subject_params)
    # if update succeeds, redirect
    flash[:notice] = "Subject updated successfully"
      redirect_to(:action => 'show', :id => @subject.id)
    else
      # if update fails, display form again
      @subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
UPDATE `subjects` SET `created_at` = '2012-05-03 01:23:00', `updated_at` = '2014-05-04 01:25:19' WHERE `subjects`.`id` = 1
SELECT COUNT(*) FROM `subjects` WHERE (1 = 1 AND position = 1)

  def delete
    @subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1

  def destroy
    subject = Subject.find(params[:id])
    subject.destroy
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 3 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 3